validation/diluteVdfTransportFoam/bubbleColumn/constant/populationBalanceProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel sizeVelocity;

sizeVelocityCoeffs
{
    odeCoeffs
    {
        solveOde off;

        ATol    1.0e-6;
        RTol    1.0e-4;
        fac     0.9;
        facMin  0.1;
        facMax  5.0;
        minLocalDt 1.0e-4;
    }

    diffusionModel
    {
        diffusionModel none;
    }

    collision  off;

    collisionKernel
    {
        collisionKernel noCollision;
        e           0.9;
    }
}

// ************************************************************************* //
