validation/diluteVdfTransportFoam/bubbleColumn/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default                         faceLimited     leastSquares 1.0;
    grad(p)                         leastSquares;
}

divSchemes
{
    default                         none;

    "div\(velocityAbscissae.*\)"    Gauss linear;
    "div\(interpolate\(velocityAbscissae.*\),velocityAbscissae.*\)" Gauss linear;
    div(alphaRhoPhi.water,U.water)      bounded Gauss limitedLinearV 1;
    div(phi.water,U.water)              bounded Gauss limitedLinearV 1;
    div(phiRhoPhi.water,e.water)        bounded Gauss limitedLinear 1;
    div(phiRhoPhi.water,K)            bounded Gauss limitedLinear 1;
    div(devRhoReff.water)             Gauss linear;
    div((phi.water|interpolate(thermo:rho.water)),U.water) Gauss linear;
    div((((alpha.water*thermo:rho.water)*nuEff.water)*dev2(T(grad(U.water))))) Gauss linear;
}

laplacianSchemes
{
    default                         Gauss linear corrected;
}

interpolationSchemes
{
    default                         linear;
}

snGradSchemes
{
    default                         corrected;
}


// ************************************************************************* //
