validation/diluteVdfTransportFoam/bubbleColumn/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air);

boundaries
{
    inlet
    {
        type    fixedValue;
        value   uniform 0.0;
    }
    outlet
    {
        type    inletOutlet;
        phi     phi.air;
        inletValue uniform 0;
    }
    left
    {
        type    cyclic;
    }
    right
    {
        type    cyclic;
    }
}

air
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension0   [0 1 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];

    default
    {
    }

    inlet
    {
        node0
        {
            weight  0.033;
            abscissa (1e-3 0 0.2);
        }
        node1
        {
            weight  0.034;
            abscissa (3e-3 0 0.2);
        }
        node2
        {
            weight  0.033;
            abscissa (5e-3 0 0.2);
        }
    }
}


// ************************************************************************* //
